describe("回答", () => {
  describe("同値分割法", () => {
    it.each`
      value    | expected
      ${0}     | ${"-"}
      ${1.0}   | ${"400"}
      ${10.0}  | ${"350"}
      ${200.0} | ${"-"}
    `(
      "生地の長さ $value メートルの場合、販売単価 $expected 円と表示されること",
      ({ value, expected }) => {}
    );
  });
  describe("境界値分析", () => {
    it.each`
      value    | expected
      ${0}     | ${"-"}
      ${0.1}   | ${"400"}
      ${3.0}   | ${"400"}
      ${3.1}   | ${"350"}
      ${100.0} | ${"350"}
      ${100.1} | ${"-"}
    `(
      "生地の長さ $value メートルの場合、販売単価 $expected 円と表示されること",
      ({ value, expected }) => {}
    );
  });
});
