describe("回答", () => {
  describe("部署コードの入力桁数", () => {
    it.each`
      value   | expected
      ${50}   | ${"-"}
      ${99}   | ${"-"}
      ${100}  | ${"本店総務部"}
      ${500}  | ${"北海道支店"}
      ${999}  | ${"該当する部署がありません"}
      ${1000} | ${"-"}
      ${1500} | ${"-"}
    `(
      "テストデータ $value の場合、部署名 $expected と表示されること",
      ({ value, expected }) => {}
    );
  });

  describe("部署コード3桁の部署名の有無", () => {
    it.each`
      value  | expected
      ${100} | ${"本店総務部"}
      ${101} | ${"該当する部署がありません"}
      ${960} | ${"沖縄支店"}
      ${999} | ${"該当する部署がありません"}
    `(
      "テストデータ $value の場合、部署名 $expected と表示されること",
      ({ value, expected }) => {}
    );
  });
});
